{"i": {}, "13": {"Name": "Connected Car Project (Intern..."}, "1": {"user_location": "Autonomous vehicles (AVs) promise to transform transportation. However, there are many challenges (human and technical) that need to be overcome before AVs reach their tipping point of adoption. In this project we will explore the key challenges around creating common understanding and trust between humans and AVs. In addition, we want to discover how to make AVs the preferred mode of transportation for riders."}, "2": {"user_location": "How can we help better educate people on the effects of their spending? Over the years, an increasingly large number of people have been almost entirely cashless and have dealt with virtual currency their entire life. Without having physical money to hold, exchange, and keep track of, understanding the daily effects of spending becomes foreign. In this project, we are creating a device that physically represents digital currency to help one visualize spending beyond the digital screen in a positive, educational, and engaging way."}, "3": {"user_location": "Position sensors are ubiquitous in today’s world – though they are often known by other names. If you have ever used a computer mouse, you have used a position sensor. This project explores coupling a low cost wireless position sensor with hand-held ultrasonic testing (UT) inspection units to make inspections faster, more accurate and safer."}, "4": {"user_location": "Join us in creating the most accessible Olli for riders with mobility (wheelchair), sight, hearing, and cognitive impairments. When Local Motors launched Olli, it was touted as your \"friendly neighborhood mobility solution.\" And with IBM Watson helping with the interactions, it certainly is friendly. But it&rsquo;s not necessarily as friendly as it needs to be. There are many riders with unique needs that Olli doesn't currently account for. We need to prepare for a significantly larger aging population, as well as helping those with mobility, hearing or visual issues, or those with cognitive disabilities. And with Olli being self-driving, the lack of a human driver poses some unique challenges in making Olli truly accessible for everyone. In the #AccessibleOlli project, we are taking the Olli platform and building upon it to make a vehicle that can be used by all riders no matter their abilities. We are taking advantage of the latest innovations in IoT technologies and teaming up with IBM Watson to truly make the world's friendliest mobility solution."}}